AxisIPCamera/Files/GetHttpsBinding.xml

<?xml version="1.0" encoding="UTF-8"?>
<Envelope xmlns="http://www.w3.org/2003/05/soap-envelope">
    <Header/>
    <Body >
        <GetWebServerTlsConfiguration xmlns="http://www.axis.com/vapix/ws/webserver"> </GetWebServerTlsConfiguration>
    </Body>
</Envelope>